12/data/attachments/f8a89530b217a27a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Greg_good_Friend_1925_4</nif:username>
            <nif:friendToBeRequested>soap_friends_679213f0-1ef1-4869-9c54-b1670eafb22c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>